// pages/home/Harmful/Harmful.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    contentArr:[{"name":"LED灯(含水银)","type":"有害垃圾"},{"name":"Ⅹ光片","type":"有害垃圾"},{"name":"安神补脑液瓶","type":"有害垃圾"},{"name":"笔记本电脑电池","type":"有害垃圾"},{"name":"保健品","type":"有害垃圾"},{"name":"保健品瓶子","type":"有害垃圾"},{"name":"板蓝根冲剂","type":"有害垃圾"},{"name":"玻璃药瓶","type":"有害垃圾"},{"name":"充电电池","type":"有害垃圾"},{"name":"除草剂","type":"有害垃圾"},{"name":"徐渍剂","type":"有害垃圾"},{"name":"电灯泡","type":"有害垃圾"},{"name":"冻干粉","type":"有害垃圾"},{"name":"碘酒瓶","type":"有害垃圾"},{"name":"达克宁药膏","type":"有害垃圾"},{"name":"达克宁药膏皮","type":"有害垃圾"},{"name":"灯泡","type":"有害垃圾"},{"name":"调色板","type":"有害垃圾"},{"name":"滴眼液","type":"有害垃圾"},{"name":"废胶卷","type":"有害垃圾"},{"name":"废节能灯","type":"有害垃圾"},{"name":"废矿物油","type":"有害垃圾"},{"name":"废镍镉电池","type":"有害垃圾"},{"name":"废农药","type":"有害垃圾"},{"name":"废弃灯泡","type":"有害垃圾"},{"name":"废弃药瓶","type":"有害垃圾"},{"name":"废水银温度计","type":"有害垃圾"},{"name":"废水银血压计","type":"有害垃圾"},{"name":"废血压计","type":"有害垃圾"},{"name":"废荧光灯管","type":"有害垃圾"},{"name":"废油漆","type":"有害垃圾"},{"name":"感光胶片","type":"有害垃圾"},{"name":"感冒药","type":"有害垃圾"},{"name":"感冒药包装","type":"有害垃圾"},{"name":"钙片","type":"有害垃圾"},{"name":"过期的胶囊药物","type":"有害垃圾"},{"name":"过期感冒药","type":"有害垃圾"},{"name":"过期西药","type":"有害垃圾"},{"name":"过期药品","type":"有害垃圾"},{"name":"过期药片","type":"有害垃圾"},{"name":"过期指甲油","type":"有害垃圾"},{"name":"膏药","type":"有害垃圾"},{"name":"膏药布","type":"有害垃圾"},{"name":"膏药包装","type":"有害垃圾"},{"name":"给药器","type":"有害垃圾"},{"name":"红花油","type":"有害垃圾"},{"name":"化学剂桶","type":"有害垃圾"},{"name":"胶合剂","type":"有害垃圾"},{"name":"酒精","type":"有害垃圾"},{"name":"胶卷底片","type":"有害垃圾"},{"name":"金霉素眼药膏","type":"有害垃圾"},{"name":"胶囊","type":"有害垃圾"},{"name":"节能灯(含水银)","type":"有害垃圾"},{"name":"胶片","type":"有害垃圾"},{"name":"工业胶水","type":"有害垃圾"},{"name":"胶水桶","type":"有害垃圾"},{"name":"金嗓子含片","type":"有害垃圾"},{"name":"口服液","type":"有害垃圾"},{"name":"口服液瓶","type":"有害垃圾"},{"name":"口服液瓶盖","type":"有害垃圾"},{"name":"口服液吸管","type":"有害垃圾"},{"name":"开塞露","type":"有害垃圾"},{"name":"咳嗽糖浆玻璃瓶","type":"有害垃圾"},{"name":"咳嗽药片","type":"有害垃圾"},{"name":"咳嗽药水瓶","type":"有害垃圾"},{"name":"空调清洗消毒液瓶","type":"有害垃圾"},{"name":"空药瓶","type":"有害垃圾"},{"name":"锂电池","type":"有害垃圾"},{"name":"雷达瓶子","type":"有害垃圾"},{"name":"卤素灯","type":"有害垃圾"},{"name":"老鼠药","type":"有害垃圾"},{"name":"录像带","type":"有害垃圾"},{"name":"灭蚊喷雾剂","type":"有害垃圾"},{"name":"马应龙","type":"有害垃圾"},{"name":"镍镉电池","type":"有害垃圾"},{"name":"扣电池","type":"有害垃圾"},{"name":"农药瓶","type":"有害垃圾"},{"name":"喷漆罐","type":"有害垃圾"},{"name":"泡腾片","type":"有害垃圾"},{"name":"铅酸电池","type":"有害垃圾"},{"name":"染发膏","type":"有害垃圾"},{"name":"染发剂","type":"有害垃圾"},{"name":"染发剂壳","type":"有害垃圾"},{"name":"染发手套","type":"有害垃圾"},{"name":"日光灯","type":"有害垃圾"},{"name":"杀虫剂","type":"有害垃圾"},{"name":"杀虫子罐","type":"有害垃圾"},{"name":"杀虫喷雾","type":"有害垃圾"},{"name":"深海鱼油","type":"有害垃圾"},{"name":"伤筋膏药","type":"有害垃圾"},{"name":"伤筋药膏包装","type":"有害垃圾"},{"name":"输液瓶","type":"有害垃圾"},{"name":"水银体温计","type":"有害垃圾"},{"name":"树脂","type":"有害垃圾"},{"name":"手机电池","type":"有害垃圾"},{"name":"松节油","type":"有害垃圾"},{"name":"塑料药盒","type":"有害垃圾"},{"name":"塑料药瓶","type":"有害垃圾"},{"name":"生石灰","type":"有害垃圾"},{"name":"碳粉盒","type":"有害垃圾"},{"name":"透明塑料药瓶","type":"有害垃圾"},{"name":"烫伤膏","type":"有害垃圾"},{"name":"烫伤药","type":"有害垃圾"},{"name":"外敷伤药","type":"有害垃圾"},{"name":"维生素","type":"有害垃圾"},{"name":"维生素瓶","type":"有害垃圾"},{"name":"蓄电池","type":"有害垃圾"},{"name":"硒鼓","type":"有害垃圾"},{"name":"瓜相","type":"有害垃圾"},{"name":"西瓜霜含片塑料铝箔包装","type":"有害垃圾"},{"name":"卸甲膜","type":"有害垃圾"},{"name":"卸甲水","type":"有害垃圾"},{"name":"卸甲油","type":"有害垃圾"},{"name":"相片底片","type":"有害垃圾"},{"name":"西药","type":"有害垃圾"},{"name":"西药瓶","type":"有害垃圾"},{"name":"药包装","type":"有害垃圾"},{"name":"次性注射器","type":"有害垃圾"},{"name":"药罐","type":"有害垃圾"},{"name":"药膏","type":"有害垃圾"},{"name":"约包裝壳","type":"有害垃圾"},{"name":"荧光灯","type":"有害垃圾"},{"name":"鱼肝油","type":"有害垃圾"},{"name":"鱼肝油盒","type":"有害垃圾"},{"name":"药壶","type":"有害垃圾"},{"name":"氧化汞电池","type":"有害垃圾"},{"name":"药剂","type":"有害垃圾"},{"name":"药瓶","type":"有害垃圾"},{"name":"药片包装","type":"有害垃圾"},{"name":"药品包装袋","type":"有害垃圾"},{"name":"药片铝塑包装","type":"有害垃圾"},{"name":"药品纸盒","type":"有害垃圾"},{"name":"油涂毛","type":"有害垃圾"},{"name":"油漆桶","type":"有害垃圾"},{"name":"药水玻璃瓶","type":"有害垃圾"},{"name":"药丸","type":"有害垃圾"},{"name":"药液袋","type":"有害垃圾"},{"name":"鱼油胶囊","type":"有害垃圾"},{"name":"医用棉签","type":"有害垃圾"},{"name":"医用纱布","type":"有害垃圾"},{"name":"药水","type":"有害垃圾"},{"name":"眼药水瓶","type":"有害垃圾"},{"name":"医用手套","type":"有害垃圾"},{"name":"医用针管","type":"有害垃圾"},{"name":"西瓜霜含片","type":"有害垃圾"},{"name":"痔疮膏","type":"有害垃圾"},{"name":"中成药","type":"有害垃圾"},{"name":"指甲油瓶子","type":"有害垃圾"},{"name":"止咳糖浆瓶","type":"有害垃圾"},{"name":"蟑螂药","type":"有害垃圾"},{"name":"樟脑丸","type":"有害垃圾"},{"name":"照片","type":"有害垃圾"},{"name":"止痛膏","type":"有害垃圾"},{"name":"纸药盒","type":"有害垃圾"},{"name":"肖毒剂","type":"有害垃圾"}]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})